In [3]:
import pandas as pd
dict = [{"name" : "Gaurav" , "rollno" : 's1' , "salary" : 1000 , "dept" : "comp"},
        {"name" : "Pratik" , "rollno" : 's2' , "salary" : 700,"dept" : "IT"},
        {"name" : "Sneha" , "rollno" : 's3' , "salary" : 600,"dept" : "comp"},
       {"name" : "Mayur" , "rollno" : 's4' , "salary" : 500,"dept" : "Mech"}
       ]

df = pd.DataFrame(dict) 

df

     name rollno  salary  dept
0  Gaurav     s1    1000  comp
1  Pratik     s2     700    IT
2   Sneha     s3     600  comp
3   Mayur     s4     500  Mech

In [4]:
#  column projection
df["name"]

0    Gaurav
1    Pratik
2     Sneha
3     Mayur
Name: name, dtype: object

In [42]:
df[["name","salary"]]

     name  salary
0  Gaurav    1000
1  Pratik     700
2   Sneha     600
3   Mayur     500

In [43]:
# # row selection using index labels 
df.iloc[0]

name      Gaurav
rollno        s1
salary      1000
dept        comp
Name: 0, dtype: object

In [44]:
df.iloc[[0,1]]

     name rollno  salary  dept
0  Gaurav     s1    1000  comp
1  Pratik     s2     700    IT

In [45]:

df= df.set_index('rollno')
df

          name  salary  dept
rollno
s1      Gaurav    1000  comp
s2      Pratik     700    IT
s3       Sneha     600  comp
s4       Mayur     500  Mech

In [46]:
df.loc['s1']

name      Gaurav
salary      1000
dept        comp
Name: s1, dtype: object

In [47]:
df.loc[['s1','s2']]

          name  salary  dept
rollno
s1      Gaurav    1000  comp
s2      Pratik     700    IT

In [48]:
df.loc['s1':'s3']

          name  salary  dept
rollno
s1      Gaurav    1000  comp
s2      Pratik     700    IT
s3       Sneha     600  comp

In [49]:
# row selection using a filter / where clause / filtering the dataset
boolean_list = df['salary'] >599 # [True,True,True,False]
df[boolean_list]

          name  salary  dept
rollno
s1      Gaurav    1000  comp
s2      Pratik     700    IT
s3       Sneha     600  comp

In [50]:
df.query('salary>599')

          name  salary  dept
rollno
s1      Gaurav    1000  comp
s2      Pratik     700    IT
s3       Sneha     600  comp

In [51]:
df.query('salary>599')["name"]

rollno
s1    Gaurav
s2    Pratik
s3     Sneha
Name: name, dtype: object

In [52]:
# row selection using a filter / where clause / filtering the dataset
boolean_list = df['salary'] >599 # [True,True,True,False]
df[boolean_list]["name"]

rollno
s1    Gaurav
s2    Pratik
s3     Sneha
Name: name, dtype: object

In [53]:
# row selection using a filter / where clause / filtering the dataset 
# and also column projection 
df.loc[df['salary'] >599,"name"]

rollno
s1    Gaurav
s2    Pratik
s3     Sneha
Name: name, dtype: object

In [54]:
boolean_list = df['dept'].isin(["comp","IT"])
df.loc[boolean_list,'name']

rollno
s1    Gaurav
s2    Pratik
s3     Sneha
Name: name, dtype: object

In [55]:
df.query('dept in ("comp","IT")')['name']

rollno
s1    Gaurav
s2    Pratik
s3     Sneha
Name: name, dtype: object

In [56]:
df['salary'] = df['salary']*.10 + df['salary']
df

          name  salary  dept
rollno
s1      Gaurav  1100.0  comp
s2      Pratik   770.0    IT
s3       Sneha   660.0  comp
s4       Mayur   550.0  Mech

In [58]:

def get_category(row):
    if  row['salary']> 999 :
        return "Overpaid"
    else:
        return "Underpaid" 
        
df['new_category'] = df.apply(get_category, axis = 1 )

df

          name  salary  dept new_category
rollno
s1      Gaurav  1100.0  comp     Overpaid
s2      Pratik   770.0    IT    Underpaid
s3       Sneha   660.0  comp    Underpaid
s4       Mayur   550.0  Mech    Underpaid

In [74]:
import re 
def get_sum(column):
        if column.dtype == type(1.1):
            sum = 0.0 
        else:   
            sum = ''
             
        for i in column.array:
            sum+=i
        return sum

# get_sum(pd.Series([1,2,3]))

df.apply(get_sum,axis = 0 )

name                         GauravPratikSnehaMayur
salary                                       3080.0
dept                                 compITcompMech
new_category    OverpaidUnderpaidUnderpaidUnderpaid
dtype: object